---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.CostPerArea
source: html/c5b16213-03c1-8be0-90c7-1fef1bb194f5.htm
---
# Autodesk.Revit.DB.SpecTypeId.CostPerArea Property

Cost per Area, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId CostPerArea { get; }
```